zephyrproject-rtos/zephyr/ext/hal/silabs/gecko/Device/SiliconLabs/EFM32WG/Include/efm32wg_usb.h
  uint32_t         RESERVED15[72U];    /**< Reserved for future use **/
  __IOM uint32_t   DOEP0CTL;           /**< Device OUT Endpoint 0 Control Register  */
  uint32_t         RESERVED16[1U];     /**< Reserved for future use **/
  __IOM uint32_t   DOEP0INT;           /**< Device OUT Endpoint 0 Interrupt Register  */
  uint32_t         RESERVED17[1U];     /**< Reserved for future use **/
  __IOM uint32_t   DOEP0TSIZ;          /**< Device OUT Endpoint 0 Transfer Size Register  */
  __IOM uint32_t   DOEP0DMAADDR;       /**< Device OUT Endpoint 0 DMA Address Register  */

  uint32_t         RESERVED18[2U];     /**< Reserved registers */
  USB_DOEP_TypeDef DOEP[6U];           /**< Device OUT Endpoint x+1 Registers */

  uint32_t         RESERVED19[136U];   /**< Reserved for future use **/
  __IOM uint32_t   PCGCCTL;            /**< Power and Clock Gating Control Register  */

  uint32_t         RESERVED20[127U];   /**< Reserved registers */
  __IOM uint32_t   FIFO0D[512U];       /**< Device EP 0/Host Channel 0 FIFO  */

  uint32_t         RESERVED21[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO1D[512U];       /**< Device EP 1/Host Channel 1 FIFO  */

  uint32_t         RESERVED22[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO2D[512U];       /**< Device EP 2/Host Channel 2 FIFO  */

  uint32_t         RESERVED23[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO3D[512U];       /**< Device EP 3/Host Channel 3 FIFO  */

  uint32_t         RESERVED24[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO4D[512U];       /**< Device EP 4/Host Channel 4 FIFO  */

  uint32_t         RESERVED25[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO5D[512U];       /**< Device EP 5/Host Channel 5 FIFO  */

  uint32_t         RESERVED26[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO6D[512U];       /**< Device EP 6/Host Channel 6 FIFO  */

  uint32_t         RESERVED27[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO7D[512U];       /**< Host Channel 7 FIFO  */

  uint32_t         RESERVED28[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO8D[512U];       /**< Host Channel 8 FIFO  */

  uint32_t         RESERVED29[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO9D[512U];       /**< Host Channel 9 FIFO  */

  uint32_t         RESERVED30[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO10D[512U];      /**< Host Channel 10 FIFO  */

  uint32_t         RESERVED31[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO11D[512U];      /**< Host Channel 11 FIFO  */

  uint32_t         RESERVED32[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO12D[512U];      /**< Host Channel 12 FIFO  */

  uint32_t         RESERVED33[512U];   /**< Reserved registers */
  __IOM uint32_t   FIFO13D[512U];      /**< Host Channel 13 FIFO  */

  uint32_t         RESERVED34[17920U]; /**< Reserved registers */
  __IOM uint32_t   FIFORAM[512U];      /**< Direct Access to Data FIFO RAM for Debugging (2 KB)  */
} USB_TypeDef;                         /**< USB Register Declaration *//** @} */

/**************************************************************************//**
 * @defgroup EFM32WG_USB_BitFields
 * @{
 *****************************************************************************/

/* Bit fields for USB CTRL */
#define _USB_CTRL_RESETVALUE                       0x00000000UL                           /**< Default value for USB_CTRL */
#define _USB_CTRL_MASK                             0x03330003UL                           /**< Mask for USB_CTRL */
#define USB_CTRL_VBUSENAP                          (0x1UL << 0)                           /**< VBUSEN Active Polarity */
#define _USB_CTRL_VBUSENAP_SHIFT                   0                                      /**< Shift value for USB_VBUSENAP */
#define _USB_CTRL_VBUSENAP_MASK                    0x1UL                                  /**< Bit mask for USB_VBUSENAP */
#define _USB_CTRL_VBUSENAP_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_VBUSENAP_LOW                     0x00000000UL                           /**< Mode LOW for USB_CTRL */
#define _USB_CTRL_VBUSENAP_HIGH                    0x00000001UL                           /**< Mode HIGH for USB_CTRL */
#define USB_CTRL_VBUSENAP_DEFAULT                  (_USB_CTRL_VBUSENAP_DEFAULT << 0)      /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_VBUSENAP_LOW                      (_USB_CTRL_VBUSENAP_LOW << 0)          /**< Shifted mode LOW for USB_CTRL */
#define USB_CTRL_VBUSENAP_HIGH                     (_USB_CTRL_VBUSENAP_HIGH << 0)         /**< Shifted mode HIGH for USB_CTRL */
#define USB_CTRL_DMPUAP                            (0x1UL << 1)                           /**< DMPU Active Polarity */
#define _USB_CTRL_DMPUAP_SHIFT                     1                                      /**< Shift value for USB_DMPUAP */
#define _USB_CTRL_DMPUAP_MASK                      0x2UL                                  /**< Bit mask for USB_DMPUAP */
#define _USB_CTRL_DMPUAP_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for USB_CTRL */
#define _USB_CTRL_DMPUAP_LOW                       0x00000000UL                           /**< Mode LOW for USB_CTRL */
#define _USB_CTRL_DMPUAP_HIGH                      0x00000001UL                           /**< Mode HIGH for USB_CTRL */
#define USB_CTRL_DMPUAP_DEFAULT                    (_USB_CTRL_DMPUAP_DEFAULT << 1)        /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_DMPUAP_LOW                        (_USB_CTRL_DMPUAP_LOW << 1)            /**< Shifted mode LOW for USB_CTRL */
#define USB_CTRL_DMPUAP_HIGH                       (_USB_CTRL_DMPUAP_HIGH << 1)           /**< Shifted mode HIGH for USB_CTRL */
#define USB_CTRL_VREGDIS                           (0x1UL << 16)                          /**< Voltage Regulator Disable */
#define _USB_CTRL_VREGDIS_SHIFT                    16                                     /**< Shift value for USB_VREGDIS */
#define _USB_CTRL_VREGDIS_MASK                     0x10000UL                              /**< Bit mask for USB_VREGDIS */
#define _USB_CTRL_VREGDIS_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for USB_CTRL */
#define USB_CTRL_VREGDIS_DEFAULT                   (_USB_CTRL_VREGDIS_DEFAULT << 16)      /**< Shifted mode DEFAULT for USB_CTRL */
#define USB_CTRL_VREGOSEN                          (0x1UL << 17)                          /**< VREGO Sense Enable */
#define _USB_CTRL_VREGOSEN_SHIFT                   17                                     /**< Shift value for USB_VREGOSEN */
#define _USB_CTRL_VREGOSEN_MASK                    0x20000UL                              /**< Bit mask for USB_VREGOSEN */
#define _USB_CTRL_VREGOSEN_DEFAULT                 0x00000000UL                           /**< Mode DEFAULT for USB_CTRL */
#define USB_CTRL_VREGOSEN_DEFAULT                  (_USB_CTRL_VREGOSEN_DEFAULT << 17)     /**< Shifted mode DEFAULT for USB_CTRL */
#define _USB_CTRL_BIASPROGEM01_SHIFT               20                                     /**< Shift value for USB_BIASPROGEM01 */
#define _USB_CTRL_BIASPROGEM01_MASK                0x300000UL                             /**< Bit mask for USB_BIASPROGEM01 */
#define _USB_CTRL_BIASPROGEM01_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for USB_CTRL */
#define USB_CTRL_BIASPROGEM01_DEFAULT              (_USB_CTRL_BIASPROGEM01_DEFAULT << 20) /**< Shifted mode DEFAULT for USB_CTRL */
#define _USB_CTRL_BIASPROGEM23_SHIFT               24                                     /**< Shift value for USB_BIASPROGEM23 */
#define _USB_CTRL_BIASPROGEM23_MASK                0x3000000UL                            /**< Bit mask for USB_BIASPROGEM23 */
#define _USB_CTRL_BIASPROGEM23_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for USB_CTRL */
#define USB_CTRL_BIASPROGEM23_DEFAULT              (_USB_CTRL_BIASPROGEM23_DEFAULT << 24) /**< Shifted mode DEFAULT for USB_CTRL */

/* Bit fields for USB STATUS */
#define _USB_STATUS_RESETVALUE                     0x00000000UL                      /**< Default value for USB_STATUS */
#define _USB_STATUS_MASK                           0x00000001UL                      /**< Mask for USB_STATUS */
#define USB_STATUS_VREGOS                          (0x1UL << 0)                      /**< VREGO Sense Output */
#define _USB_STATUS_VREGOS_SHIFT                   0                                 /**< Shift value for USB_VREGOS */
#define _USB_STATUS_VREGOS_MASK                    0x1UL                             /**< Bit mask for USB_VREGOS */
#define _USB_STATUS_VREGOS_DEFAULT                 0x00000000UL                      /**< Mode DEFAULT for USB_STATUS */
#define USB_STATUS_VREGOS_DEFAULT                  (_USB_STATUS_VREGOS_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_STATUS */

